In [67]:
import pandas as pd
import numpy as np

In [68]:
df = pd.read_csv("./Datasets/Dataset_1.csv")
df.head()

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,yes
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,yes
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,yes

In [69]:
# 1 : Identity all rows where order amount is non numeric but isdetlivered is marked as delivered
df['order_amount'].unique() , df['is_delivered'].unique()

(array(['250.5', '1200', nan, '3500.75', '₹999', '499.99'], dtype=object),
 array(['True', 'yes', 'False', 'no', nan], dtype=object))

In [70]:
df['order_amount'].replace("₹999","999" , inplace =True)

In [71]:
df.order_amount = df.order_amount.astype("float64")

In [72]:
df['order_amount'].unique()

array([ 250.5 , 1200.  ,     nan, 3500.75,  999.  ,  499.99])

In [73]:
df['is_delivered'].replace({"yes":"True" , "no" : "False"} , inplace=True)

In [74]:
df.is_delivered.unique()

array(['True', 'False', nan], dtype=object)

In [75]:
df[( df.order_amount.isna() ) & ( df.is_delivered == "True" )]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
14,ORD1014,CUST14,25.0,NaN,2023/03/10,upi,DELHI,5,True
17,NaN,NaN,-3.0,NaN,15/02/2023,upi,Hyderabad,NaN,True
29,NaN,user_29,NaN,NaN,NaN,Debit Card,DELHI,7,True
38,NaN,CUST38,35.0,NaN,15/02/2023,CARD,NaN,1,True
...,...,...,...,...,...,...,...,...,...
970,ORD1970,NaN,18.0,NaN,NaN,Cash,Hyderabad,7,True
982,NaN,CUST982,25.0,NaN,15/02/2023,NaN,Bangalore,2,True
987,NaN,CUST987,50.0,NaN,2023/03/10,NaN,Bangalore,NaN,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [76]:
# 2:Convert order_date to date time and find orders where delivery days is negative after valid date conversion

df.order_date.unique() , df.delivery_days.unique()

(array(['2023-01-15', '2023/03/10', nan, 'invalid', '15/02/2023'],
       dtype=object),
 array(['5', '7', 'three', '1', '-1', '2', nan], dtype=object))

In [77]:
df.order_date.replace('invalid' , np.nan , inplace=True)

In [78]:
df['order_date'] = pd.to_datetime(df['order_date'] , errors='coerce' , dayfirst = True)

C:\Users\SriHarshaK\AppData\Local\Temp\ipykernel_17240\523929624.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df['order_date'] = pd.to_datetime(df['order_date'] , errors='coerce' , dayfirst = True)

In [79]:
df.delivery_days.replace('three' , '3',inplace = True)

In [80]:
df[(df['delivery_days'].astype("float64") <0 ) & ( df['order_date'].notna() ) ]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
99,NaN,NaN,50.0,250.50,2023-01-15,Debit Card,Hyderabad,-1,NaN
115,ORD1115,NaN,-3.0,250.50,2023-01-15,Cash,mumbai,-1,False
143,NaN,user_143,25.0,3500.75,2023-01-15,Debit Card,Hyderabad,-1,NaN
155,NaN,CUST155,NaN,499.99,2023-01-15,upi,Delhi,-1,True
170,NaN,NaN,NaN,1200.00,2023-01-15,Cash,DELHI,-1,True
238,ORD1238,user_238,NaN,NaN,2023-01-15,CARD,DELHI,-1,False
270,NaN,NaN,35.0,999.00,2023-01-15,CARD,Delhi,-1,False
272,NaN,user_272,65.0,NaN,2023-01-15,UPI,NaN,-1,NaN
303,ORD1303,user_303,35.0,250.50,2023-01-15,Cash,Hyderabad,-1,False
334,NaN,user_334,50.0,499.99,2023-01-15,upi,Delhi,-1,False
407,NaN,NaN,65.0,1200.00,2023-01-15,CARD,DELHI,-1,True
429,NaN,user_429,35.0,999.00,2023-01-15,CARD,NaN,-1,NaN
493,NaN,NaN,-3.0,1200.00,2023-01-15,CARD,Hyderabad,-1,False
561,NaN,user_561,25.0,3500.75,2023-01-15,upi,DELHI,-1,True
628,NaN,NaN,50.0,999.00,2023-01-15,upi,Delhi,-1,False
639,NaN,CUST639,-3.0,499.99,2023-01-15,Cash,DELHI,-1,False
674,NaN,NaN,18.0,999.00,2023-01-15,upi,mumbai,-1,True
720,ORD1720,NaN,35.0,1200.00,2023-01-15,upi,NaN,-1,False
726,NaN,NaN,NaN,499.99,2023-01-15,upi,Hyderabad,-1,False
741,ORD1741,CUST741,50.0,250.50,2023-01-15,UPI,Mumbai,-1,True
751,ORD1751,NaN,35.0,NaN,2023-01-15,Cash,Delhi,-1,True
763,NaN,NaN,NaN,250.50,2023-01-15,Debit Card,DELHI,-1,NaN
780,ORD1780,NaN,25.0,NaN,2023-01-15,upi,Hyderabad,-1,True
838,NaN,user_838,NaN,3500.75,2023-01-15,NaN,Mumbai,-1,False
880,ORD1880,user_880,35.0,1200.00,2023-01-15,Cash,Mumbai,-1,True
934,NaN,NaN,-3.0,NaN,2023-01-15,UPI,mumbai,-1,False
937,ORD1937,CUST937,-3.0,NaN,2023-01-15,Debit Card,mumbai,-1,True
945,ORD1945,NaN,NaN,250.50,2023-01-15,NaN,mumbai,-1,False

In [85]:
# 3 : standazider payment mode and calculate the percentage share of each mode per city

df.payment_mode.replace({'Debit Card':'Card' , 'Credit Card' : 'Card'} ,inplace=True)

In [86]:
df.payment_mode.unique()

array(['Card', nan, 'Cash', 'CARD', 'upi', 'UPI'], dtype=object)

In [88]:
df.payment_mode = df.payment_mode.str.title()

In [93]:
df.city = df.city.str.title()

In [95]:
df.city.unique() , df.payment_mode.unique()

(array([nan, 'Mumbai', 'Bangalore', 'Delhi', 'Hyderabad'], dtype=object),
 array(['Card', nan, 'Cash', 'Upi'], dtype=object))

In [112]:
val = df.groupby(['city','payment_mode']).size()

In [118]:
val / val.groupby('city').sum() *100

city       payment_mode
Bangalore  Card            50.000000
           Cash            17.187500
           Upi             32.812500
Delhi      Card            50.549451
           Cash            16.849817
           Upi             32.600733
Hyderabad  Card            52.136752
           Cash            17.094017
           Upi             30.769231
Mumbai     Card            44.196429
           Cash            19.642857
           Upi             36.160714
dtype: float64

In [119]:
# 4 : detect customers whose customer age is invalid but have order amounts above the dataset median

df.customer_age.unique() , df.order_amount.uni

array([ nan,  18.,  35.,  -3., 120.,  65.,  25.,  50.])

In [122]:
orderMd = df.order_amount.median()

In [129]:
df[ ( (df['customer_age'] < 0 ) | ( df['customer_age'] >100) ) & ( df['order_amount'] > orderMd)  ]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,Card,NaN,3,True
34,ORD1034,NaN,120.0,3500.75,NaT,Card,Hyderabad,7,True
49,ORD1049,CUST49,120.0,3500.75,NaT,NaN,Hyderabad,-1,False
53,NaN,user_53,120.0,3500.75,NaT,Card,Hyderabad,NaN,NaN
59,NaN,NaN,-3.0,3500.75,NaT,Cash,Bangalore,3,False
...,...,...,...,...,...,...,...,...,...
954,NaN,user_954,120.0,1200.00,2023-01-15,Cash,Mumbai,1,True
971,ORD1971,NaN,120.0,1200.00,NaT,Card,Delhi,3,NaN
988,NaN,NaN,120.0,3500.75,NaT,Cash,Bangalore,2,True
991,NaN,NaN,-3.0,3500.75,NaT,Card,Hyderabad,1,True
995,NaN,user_995,-3.0,3500.75,NaT,Upi,Mumbai,1,True

In [130]:
df.shape

(1000, 9)